In [1]:
import sys
sys.version

'3.8.8 (default, Apr 13 2021, 15:08:03) [MSC v.1916 64 bit (AMD64)]'

In [2]:
import keyword
keyword.kwlist

['False',
 'None',
 'True',
 'and',
 'as',
 'assert',
 'async',
 'await',
 'break',
 'class',
 'continue',
 'def',
 'del',
 'elif',
 'else',
 'except',
 'finally',
 'for',
 'from',
 'global',
 'if',
 'import',
 'in',
 'is',
 'lambda',
 'nonlocal',
 'not',
 'or',
 'pass',
 'raise',
 'return',
 'try',
 'while',
 'with',
 'yield']

In [3]:
import pandas as pd
df = pd.DataFrame(keyword.kwlist)
df

           0
0      False
1       None
2       True
3        and
4         as
5     assert
6      async
7      await
8      break
9      class
10  continue
11       def
12       del
13      elif
14      else
15    except
16   finally
17       for
18      from
19    global
20        if
21    import
22        in
23        is
24    lambda
25  nonlocal
26       not
27        or
28      pass
29     raise
30    return
31       try
32     while
33      with
34     yield

In [4]:
a=10
id(a)

140706498947152

In [5]:
b=0b1111
b

15

In [6]:
b=0o111
b

73

In [7]:
a=0o10
a

8

In [8]:
b=0b0000
b

0

In [9]:
bool(10+20j)

True

In [10]:
a=5.e4
a

50000.0

In [11]:
b=2.4e3
b

2400.0

In [12]:
x=1.99
y=10
id(x)

2440111048656

In [13]:
id(y)

140706498947152

# type casting

In [14]:
a=10

In [15]:
float(a)

10.0

In [16]:
str(a)

'10'

In [17]:
bool(a)

True

In [18]:
complex(a)

(10+0j)

In [19]:
b=2.8

In [20]:
int(b)

2

In [21]:
str(b)

'2.8'

In [22]:
bool(b)

True

In [23]:
complex(b)

(2.8+0j)

In [24]:
import numpy as np

In [25]:
np.arange(0,10,2)

array([0, 2, 4, 6, 8])

In [26]:
import pandas as pd

In [27]:
stats = pd.read_csv("DemographicData.csv")

In [28]:
stats

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income
...,...,...,...,...,...
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

In [29]:
stats.shape

(195, 5)

In [30]:
len(stats)

195

In [31]:
stats.columns

Index(['CountryName', 'CountryCode', 'BirthRate', 'InternetUsers',
       'IncomeGroup'],
      dtype='object')

In [32]:
stats.head()

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income

In [33]:
stats.tail()

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

In [34]:
stats.head(4)

   CountryName CountryCode  BirthRate  InternetUsers          IncomeGroup
0        Aruba         ABW     10.244           78.9          High income
1  Afghanistan         AFG     35.253            5.9           Low income
2       Angola         AGO     45.985           19.1  Upper middle income
3      Albania         ALB     12.877           57.2  Upper middle income

In [35]:
stats.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 195 entries, 0 to 194
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   CountryName    195 non-null    object
 1   CountryCode    195 non-null    object
 2   BirthRate      195 non-null    float64
 3   InternetUsers  195 non-null    float64
 4   IncomeGroup    195 non-null    object
dtypes: float64(2), object(3)
memory usage: 7.7+ KB

In [36]:
stats.describe()

        BirthRate  InternetUsers
count  195.000000     195.000000
mean    21.469928      42.076471
std     10.605467      29.030788
min      7.900000       0.900000
25%     12.120500      14.520000
50%     19.680000      41.000000
75%     29.759500      66.225000
max     49.661000      96.546800

In [37]:
stats.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
BirthRate,195.0,21.469928,10.605467,7.9,12.1205,19.68,29.7595,49.6610
InternetUsers,195.0,42.076471,29.030788,0.9,14.5200,41.00,66.2250,96.5468

In [38]:
stats.isnull().sum()

CountryName      0
CountryCode      0
BirthRate        0
InternetUsers    0
IncomeGroup      0
dtype: int64

In [39]:
import pandas as pd

In [40]:
movie=pd.read_csv('movie.csv')

In [41]:
movie

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
27273,131254,Kein Bund für's Leben (2007),Comedy
27274,131256,"Feuer, Eis & Dosenbier (2002)",Comedy
27275,131258,The Pirates (2014),Adventure
27276,131260,Rentun Ruusu (2001),(no genres listed)
27277,131262,Innocence (2014),Adventure|Fantasy|Horror

In [42]:
tag=pd.read_csv('tag.csv')

In [43]:
tag

        userId  movieId            tag            timestamp
0           18     4141    Mark Waters  2009-04-24 18:19:40
1           65      208      dark hero  2013-05-10 01:41:18
2           65      353      dark hero  2013-05-10 01:41:19
3           65      521  noir thriller  2013-05-10 01:39:43
4           65      592      dark hero  2013-05-10 01:41:18
...        ...      ...            ...                  ...
465559  138446    55999        dragged  2013-01-23 23:29:32
465560  138446    55999  Jason Bateman  2013-01-23 23:29:38
465561  138446    55999         quirky  2013-01-23 23:29:38
465562  138446    55999            sad  2013-01-23 23:29:32
465563  138472      923  rise to power  2007-11-02 21:12:47

[465564 rows x 4 columns]

In [44]:
rating=pd.read_csv('rating.csv',sep=',')
parse_dates=['timestamp']
rating.head()

   userId  movieId  rating            timestamp
0       1        2     3.5  2005-04-02 23:53:47
1       1       29     3.5  2005-04-02 23:31:16
2       1       32     3.5  2005-04-02 23:33:39
3       1       47     3.5  2005-04-02 23:32:07
4       1       50     3.5  2005-04-02 23:29:40

In [45]:
#del rating['timestamp']

In [46]:
rating

          userId  movieId  rating            timestamp
0              1        2     3.5  2005-04-02 23:53:47
1              1       29     3.5  2005-04-02 23:31:16
2              1       32     3.5  2005-04-02 23:33:39
3              1       47     3.5  2005-04-02 23:32:07
4              1       50     3.5  2005-04-02 23:29:40
...          ...      ...     ...                  ...
20000258  138493    68954     4.5  2009-11-13 15:42:00
20000259  138493    69526     4.5  2009-12-03 18:31:48
20000260  138493    69644     3.0  2009-12-07 18:10:57
20000261  138493    70286     5.0  2009-11-13 15:42:24
20000262  138493    71619     2.5  2009-10-17 20:25:36

[20000263 rows x 4 columns]

In [47]:
row_1=rating.iloc[0]

In [48]:
row_1

userId                         1
movieId                        2
rating                       3.5
timestamp    2005-04-02 23:53:47
Name: 0, dtype: object

In [49]:
row_1['userId']

1

In [50]:
row_0=tag.iloc[0]
type(row_0)

pandas.core.series.Series

In [51]:
row_0

userId                        18
movieId                     4141
tag                  Mark Waters
timestamp    2009-04-24 18:19:40
Name: 0, dtype: object

In [52]:
row_0.index

Index(['userId', 'movieId', 'tag', 'timestamp'], dtype='object')

In [53]:
row_0['userId']

18

In [54]:
'rating' in row_0

False

In [55]:
row_0.name

0

In [56]:
row_0=row_0.rename('firstRow')

In [57]:
row_0.name

'firstRow'

# DataFrames

In [58]:
tag.head()

   userId  movieId            tag            timestamp
0      18     4141    Mark Waters  2009-04-24 18:19:40
1      65      208      dark hero  2013-05-10 01:41:18
2      65      353      dark hero  2013-05-10 01:41:19
3      65      521  noir thriller  2013-05-10 01:39:43
4      65      592      dark hero  2013-05-10 01:41:18

In [59]:
tag.index

RangeIndex(start=0, stop=465564, step=1)

In [60]:
tag.iloc[[0,11,20]]

    userId  movieId            tag            timestamp
0       18     4141    Mark Waters  2009-04-24 18:19:40
11      65     1783  noir thriller  2013-05-10 01:39:43
20      65     6539       treasure  2013-05-10 01:39:09

# Descriptive Statistics

In [61]:
rating['rating'].describe()

count    2.000026e+07
mean     3.525529e+00
std      1.051989e+00
min      5.000000e-01
25%      3.000000e+00
50%      3.500000e+00
75%      4.000000e+00
max      5.000000e+00
Name: rating, dtype: float64

In [62]:
rating.describe()

             userId       movieId        rating
count  2.000026e+07  2.000026e+07  2.000026e+07
mean   6.904587e+04  9.041567e+03  3.525529e+00
std    4.003863e+04  1.978948e+04  1.051989e+00
min    1.000000e+00  1.000000e+00  5.000000e-01
25%    3.439500e+04  9.020000e+02  3.000000e+00
50%    6.914100e+04  2.167000e+03  3.500000e+00
75%    1.036370e+05  4.770000e+03  4.000000e+00
max    1.384930e+05  1.312620e+05  5.000000e+00

In [63]:
rating['rating'].mean()

3.5255285642993797

In [ ]:
rating.mean()

In [ ]:
rating['rating'].min()

In [ ]:
rating['rating'].max()

In [ ]:
rating['rating'].std()

In [ ]:
rating['rating'].mode()

In [ ]:
rating.corr()

In [ ]:
filter1= rating['rating']>10
filter1
filter1.any()

In [ ]:
filter2= rating['rating']>0
filter2.all()

# Data Cleaning: Handling Missing Data

In [ ]:
movie.shape

In [ ]:
movie.isnull().any().any()

In [ ]:
rating.shape

In [ ]:
rating.isnull().any().any()

In [ ]:
tag.shape

In [ ]:
tag.isnull().any().any()

In [ ]:
tags= tag.dropna()

In [ ]:
tags.isnull().any().any()

In [ ]:
tags.shape

In [ ]:
%matplotlib inline
rating.hist(column='rating',figsize=(10,5))

In [ ]:
rating.boxplot(column=('rating'),figsize=(10,5))

# Slicing Out Columns

In [ ]:
tags['tag'].head()

In [ ]:
movie.head()

In [ ]:
movie[['title','genres']].head()

In [ ]:
rating[-10:]

In [ ]:
tag_counts = tags['tag'].value_counts()
tag_counts[-10:]

In [ ]:
tag_counts[:10].plot(kind='bar',figsize=(10,5))

In [ ]:
is_highly_rated = rating['rating']>=5.0
rating[is_highly_rated][30:50]

In [ ]:
is_action = movie['genres'].str.contains('Action')
movie[is_action][5:15]

In [ ]:
movie[is_action].head(15)

# Group by and Aggregate

In [ ]:
rating_count = rating[['movieId','rating']].groupby('rating').count()
rating_count

In [ ]:
average_rating = rating[['movieId','rating']].groupby('movieId').mean()
average_rating.head()

In [ ]:
movie_count = rating[['movieId', 'rating']].groupby('movieId').count()
movie_count.head()

In [ ]:
movie_count = rating[['movieId','rating']].groupby('movieId').count()
movie_count.tail()

In [ ]:
tag.head()

In [ ]:
#tag.drop('timestamp',axis=1)

In [ ]:
tags.head()

In [ ]:
movie.head()

In [ ]:
t= movie.merge(tag, on='movieId', how='inner')
t.head()

# Combine aggreagation, merging, and filters to get useful analytics

In [ ]:
avg_ratings= rating.groupby('movieId', as_index=False).mean()
del avg_ratings['userId']
avg_ratings.head()

In [ ]:
box_office = movie.merge(avg_ratings, on='movieId', how='inner')
box_office.tail()

In [ ]:
is_highly_rated = box_office['rating'] >= 4.0
box_office[is_highly_rated][-5:]

In [ ]:
is_Adventure = box_office['genres'].str.contains('Adventure')
box_office[is_Adventure][:5]

In [ ]:
box_office[is_Adventure & is_highly_rated][-5:]

# Vectorized String Operations

In [ ]:
movie.head()


🔬 Split 'genres' into multiple columns

In [ ]:
movie_genres = movie['genres'].str.split('|', expand=True)

In [ ]:
movie_genres[:10]

In [ ]:
movie_genres['isComedy'] = movie['genres'].str.contains('Comedy')

In [ ]:
movie_genres[:10]


📟 Extract year from title e.g. (2007)

In [ ]:
movie['year']= movie['title'].str.extract('.*\((.*)\).*',expand=True)

In [ ]:
movie.tail()

# 🕐 Parsing Timestamps

# Timestamps are common in sensor data or other time series datasets. Let us revisit the tags.csv dataset and read the timestamps!

In [ ]:
tags = pd.read_csv('tag.csv', sep=',')

In [ ]:
tags.dtypes

In [ ]:
tags.head()

In [ ]:
tags['parsed_time']= pd.to_datetime(tags['timestamp'],unit='s')

In [ ]:
tags['parsed_time'].dtype